code-review/NRB_3471_3546/База_Стало/Catalogs/РазделыСчетаДепоМХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РазделыСчетаДепоМХ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СчетаДепоМХ</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерПоручения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОткрытияСчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазделаСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийКодНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЗакрытияРаздела</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/РазделыСчетаДепоМХ/Ext/ObjectModule.bsl
// Хранит значения реквизитов для Kafka перед записью текущего состояния
Перем ИсходноеСостояниеРаздела;

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = СокрЛП(Код);
	КонецЕсли;
	
	ИсходноеСостояниеРаздела = ТекущиеЗначенияПолей();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Ключ_AccountMX = "AccountMX";
	ДанныеМХ = ДанныеВыгрузки();
	
	ЭтоНовыйРаздел = ИсходноеСостояниеРаздела.ЭтоНовый Или (ИсходноеСостояниеРаздела.ПометкаУдаления И Не ПометкаУдаления);
	ПомеченНаУдаление = Не ИсходноеСостояниеРаздела.ПометкаУдаления И ПометкаУдаления;
	
	Если ЭтоНовыйРаздел Тогда
		ИзменилисьРеквизитыКВыгрузке = Ложь;
		ИзменилсяВнешнийКлюч = Ложь;
		ЭтоНовыйРаздел = Истина;
	Иначе
		ИзменилисьРеквизитыКВыгрузке = ИзменилисьРеквизитыКВыгрузке(ДанныеМХ, ИсходноеСостояниеРаздела.ПроверяемыеПоля);
		ИзменилсяВнешнийКлюч = ИзменилисьРеквизитыКВыгрузке
								И (ДанныеМХ.DepoMxFactCode <> ИсходноеСостояниеРаздела.ПроверяемыеПоля.DepoMxFactCode
									Или ДанныеМХ.DepoMxDivisionCode <> ИсходноеСостояниеРаздела.ПроверяемыеПоля.DepoMxDivisionCode);
	КонецЕсли;
	
	Если ИзменилсяВнешнийКлюч Или ПомеченНаУдаление Тогда
		ДанныеМХИсходные = ДанныеВыгрузки(ИсходноеСостояниеРаздела.ОтправляемыеПоля);
		СоздатьСообщениеКафка(ДанныеМХИсходные, "DEL");
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		Если ЭтоНовыйРаздел Или ИзменилсяВнешнийКлюч Тогда
			СоздатьСообщениеКафка(ДанныеМХ, "INS");
		КонецЕсли;
		
		Если Не ИзменилсяВнешнийКлюч И ИзменилисьРеквизитыКВыгрузке Тогда
			СоздатьСообщениеКафка(ДанныеМХ, "UPD");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьСообщениеКафка(Данные, ActionType)
	СтруктураСообщения = НовыйРазделСчетаМХ_ДляKafka(Данные, ActionType);
	ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(СтруктураСообщения.MessageInfo, СтруктураСообщения.Data);
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoAccounts;
	Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, "AccountMX", ТекстJSON, , Ссылка);
КонецПроцедуры

Функция ДанныеВыгрузки(ИсходныеЗначенияПолей = Неопределено)
	Если ИсходныеЗначенияПолей = Неопределено Тогда
		ЗначенияПолей = ТекущиеЗначенияПолей().ОтправляемыеПоля;
	Иначе
		ЗначенияПолей = ИсходныеЗначенияПолей;
	КонецЕсли;
	
	AccountMX = Новый Структура;
	AccountMX.Вставить("ObjectVersion", ИсторияДанныхВызовСервера.КоличествоВерсийОбъекта(Ссылка) + 1);
	AccountMX.Вставить("AccountCode", ЗначенияПолей.AccountCode);
	AccountMX.Вставить("AccountType", ЗначенияПолей.AccountType);
	AccountMX.Вставить("DepoMxFactCode", ЗначенияПолей.DepoMxFactCode);
	Если ИсходныеЗначенияПолей = Неопределено Тогда
		AccountMX.Вставить("DepoMxDivisionCode", СокрЛП(Код));
		AccountMX.Вставить("DateStart", ДатаОткрытияСчета);
		AccountMX.Вставить("DateEnd", ДатаЗакрытияСчета);
	Иначе
		AccountMX.Вставить("DepoMxDivisionCode", ЗначенияПолей.DepoMxDivisionCode);
		AccountMX.Вставить("DateStart", ЗначенияПолей.DateStart);
		AccountMX.Вставить("DateEnd", ЗначенияПолей.DateEnd);
	КонецЕсли;
	AccountMX.Вставить("DepoFirmId", ЗначенияПолей.DepoFirmId);
	AccountMX.Вставить("DepoFirmInn", ЗначенияПолей.DepoFirmInn);
	AccountMX.Вставить("DepoFirmKpp", ЗначенияПолей.DepoFirmKpp);
	
	Возврат AccountMX;
КонецФункции

Функция НовыйРазделСчетаМХ_ДляKafka(СтруктураСообщения, ActionType)
	
	MessageInfo = ОбменДаннымиКафка.ДанныеMessageInfo();
	MessageInfo.MessageType = "AccountMx";
	MessageInfo.ActionType = ActionType;
	MessageInfo.JsonVersion = "1.0.0";
	
	СтруктураСообщения.DateEnd = РаботаСJSON.ПредставлениеПустойДатыJSON(СтруктураСообщения.DateEnd);
	СтруктураСообщения.DateStart = РаботаСJSON.ПредставлениеПустойДатыJSON(СтруктураСообщения.DateStart);

	Ответ = Новый Структура("MessageInfo,Data", MessageInfo, СтруктураСообщения);
	Возврат Ответ;

КонецФункции

Функция ИзменилисьРеквизитыКВыгрузке(ТекущиеДанные, ПроверяемыеРеквизиты)
	Для Каждого Реквизит Из ПроверяемыеРеквизиты Цикл
		Если Реквизит.Значение <> ТекущиеДанные[Реквизит.Ключ] Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция ПустаяСтруктура(ТипСтруктуры)
	НоваяСтруктура = Новый Структура;
	
	НоваяСтруктура.Вставить("DepoMxDivisionCode");
	НоваяСтруктура.Вставить("DepoMxFactCode");
	
	Если ТипСтруктуры = "ПроверяемыеПоля" Или ТипСтруктуры = "ОтправляемыеПоля" Тогда
		НоваяСтруктура.Вставить("AccountCode");
		НоваяСтруктура.Вставить("AccountType");
		НоваяСтруктура.Вставить("DateEnd");
		НоваяСтруктура.Вставить("DateStart");
	КонецЕсли;
	
	Если ТипСтруктуры = "ОтправляемыеПоля" Тогда
		НоваяСтруктура.Вставить("DepoFirmId");
		НоваяСтруктура.Вставить("DepoFirmInn");
		НоваяСтруктура.Вставить("DepoFirmKpp");
	КонецЕсли;
	
	Возврат НоваяСтруктура;
КонецФункции

Функция ТекущиеЗначенияПолей()
	УникальныеПоля = ПустаяСтруктура("УникальныеПоля");
	ПроверяемыеПоля = ПустаяСтруктура("ПроверяемыеПоля");
	ОтправляемыеПоля = ПустаяСтруктура("ОтправляемыеПоля");
	ЭтоНовый = ЭтоНовый();
	ЕстьПометкаУдаления = ПометкаУдаления;
	
	Если Не ЭтоНовый Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(РазделыСчетаДепоМХ.Владелец.Владелец.Код, """") КАК DepoFirmId,
		|	ЕСТЬNULL(РазделыСчетаДепоМХ.Владелец.Владелец.ИНН, """") КАК DepoFirmInn,
		|	ЕСТЬNULL(РазделыСчетаДепоМХ.Владелец.Владелец.КПП, """") КАК DepoFirmKpp,
		|	РазделыСчетаДепоМХ.Владелец.КраткийКод КАК AccountCode,
		|	РазделыСчетаДепоМХ.Владелец.ТипСчета КАК AccountType,
		|	РазделыСчетаДепоМХ.Владелец.Код КАК DepoMxFactCode,
		|	РазделыСчетаДепоМХ.Код КАК DepoMxDivisionCode,
		|	РазделыСчетаДепоМХ.ДатаОткрытияСчета КАК DateStart,
		|	РазделыСчетаДепоМХ.ДатаЗакрытияСчета КАК DateEnd,
		|	РазделыСчетаДепоМХ.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.РазделыСчетаДепоМХ КАК РазделыСчетаДепоМХ
		|ГДЕ
		|	РазделыСчетаДепоМХ.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Для Каждого Поле Из ОтправляемыеПоля Цикл
				ИмяПоля = Поле.Ключ;
				ЗначениеИзВыборки = Выборка[ИмяПоля];
				Если ИмяПоля = "AccountType" Тогда
					ЗначениеПоля = Перечисления.ТипыСчетовДепо.ТипСчетаМХДляKafka(ЗначениеИзВыборки);
				ИначеЕсли ТипЗнч(ЗначениеИзВыборки) = Тип("Строка") Тогда
					ЗначениеПоля = СокрЛП(ЗначениеИзВыборки);
				Иначе
					ЗначениеПоля = ЗначениеИзВыборки;
				КонецЕсли;
				ОтправляемыеПоля[ИмяПоля] = ЗначениеПоля;
			КонецЦикла;
			ЕстьПометкаУдаления = Выборка.ПометкаУдаления;
			ЗаполнитьЗначенияСвойств(УникальныеПоля, ОтправляемыеПоля);
			ЗаполнитьЗначенияСвойств(ПроверяемыеПоля, ОтправляемыеПоля);
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ЭтоНовый", ЭтоНовый);
	Результат.Вставить("ПометкаУдаления", ЕстьПометкаУдаления);
	Результат.Вставить("УникальныеПоля", УникальныеПоля);
	Результат.Вставить("ПроверяемыеПоля", ПроверяемыеПоля);
	Результат.Вставить("ОтправляемыеПоля", ОтправляемыеПоля);
	
	Возврат Результат;
КонецФункции
